Unsupervised learning : Clustering

K-Means Algorithm

Hierarchial Algorithm

In [2]:
#imports
import pandas as pd
import numpy as np
import tensorflow as tf

In [7]:
#Import Product DataSet here
import os, types
import pandas as pd
from botocore.client import Config
import ibm_boto3

def __iter__(self): return 0

# @hidden_cell
# The following code accesses a file in your IBM Cloud Object Storage. It includes your credentials.
# You might want to remove those credentials before you share the notebook.

if os.environ.get('RUNTIME_ENV_LOCATION_TYPE') == 'external':
    endpoint_728c62a031374147b65b556e94e09079 = 'https://s3.eu.cloud-object-storage.appdomain.cloud'
else:
    endpoint_728c62a031374147b65b556e94e09079 = 'https://s3.private.eu.cloud-object-storage.appdomain.cloud'

client_728c62a031374147b65b556e94e09079 = ibm_boto3.client(service_name='s3',
    ibm_api_key_id='ksGDLrJX_9ySoPiBVbtQHxMgWhXwVE5a_sxQL6s8FsCh',
    ibm_auth_endpoint="https://iam.cloud.ibm.com/oidc/token",
    config=Config(signature_version='oauth'),
    endpoint_url=endpoint_728c62a031374147b65b556e94e09079)

body = client_728c62a031374147b65b556e94e09079.get_object(Bucket='clustering-donotdelete-pr-mxqgdtfoayvpo1',Key='Product Data Set - Student 2 of 3.csv')['Body']
# add missing __iter__ method, so pandas accepts body as file-like object
if not hasattr(body, "__iter__"): body.__iter__ = types.MethodType( __iter__, body )

product_data = pd.read_csv(body)
product_data.head()

  PRODUCT CODE|PRODUCT CATEGORY|UNIT LIST PRICE
0                 30001|HEALTH & BEAUTY| $7.45
1                 30002|HEALTH & BEAUTY| $5.35
2                 30003|HEALTH & BEAUTY| $5.49
3                 30004|HEALTH & BEAUTY| $6.46
4                 30005|HEALTH & BEAUTY| $7.33

In [23]:
#Import Transaction DataSet here
body = client_728c62a031374147b65b556e94e09079.get_object(Bucket='clustering-donotdelete-pr-mxqgdtfoayvpo1',Key='Transaction Data Set - Student 3 of 3.csv')['Body']
# add missing __iter__ method, so pandas accepts body as file-like object
if not hasattr(body, "__iter__"): body.__iter__ = types.MethodType( __iter__, body )

transaction_data = pd.read_csv(body)
transaction_data.head()

  CUSTOMER NUM|PRODUCT NUM|QUANTITY PURCHASED|DISCOUNT TAKEN|TRANSACTION DATE|STOCKOUT
0                         10114|30011|4|0|1/2/2015|0
1                         10217|30016|3|0|1/2/2015|0
2                         10224|30013|4|0|1/2/2015|0
3                       10103|30012|3|0.2|1/2/2015|0
4                         10037|30010|8|0|1/2/2015|0

In [16]:
#Import Customer Dataset Here
body = client_728c62a031374147b65b556e94e09079.get_object(Bucket='clustering-donotdelete-pr-mxqgdtfoayvpo1',Key='Customer Data Set - Student 1 of 3.csv')['Body']
# add missing __iter__ method, so pandas accepts body as file-like object
if not hasattr(body, "__iter__"): body.__iter__ = types.MethodType( __iter__, body )

customer_data = pd.read_csv(body)
customer_data.head()

,CUSTOMERID,GENDER,AGE,INCOME,EXPERIENCE SCORE,LOYALTY GROUP,ENROLLMENT DATE,HOUSEHOLD SIZE,MARITAL STATUS
0,10001,0,64,"$133,498",5,enrolled,06-03-2013,4,Single
1,10002,0,42,"$94,475",9,notenrolled,NaN,6,Married
2,10003,0,40,"$88,610",9,enrolled,02-09-2010,5,Married
3,10004,0,38,"$84,313",8,enrolled,06-04-2015,1,Single
4,10005,0,30,"$51,498",3,notenrolled,NaN,1,Single

In [17]:
customer_data["INCOME"]

0      $133,498
1       $94,475
2       $88,610
3       $84,313
4       $51,498
         ...
495    $113,125
496    $118,108
497     $97,353
498     $34,424
499     $75,114
Name: INCOME, Length: 500, dtype: object

In [43]:
#REMOVING THE $ AND , FROM customer df income column by applying a string replace method
#map() function in Python takes in a function and a list.

customer_data["INCOME"] = customer_data["INCOME"].map(lambda x : x.replace("$",""))

customer_data["INCOME"] = customer_data["INCOME"].map(lambda x : int(x.replace(",","")) )

In [44]:
customer_data["INCOME"]

0      133498
1       94475
2       88610
3       84313
4       51498
        ...
495    113125
496    118108
497     97353
498     34424
499     75114
Name: INCOME, Length: 500, dtype: int64

CUSTOMER VIEW

Create a Pandas frame that is called “trans_products” by joining transactions_data and product_data.
Use the merge command and specify the join method as inner and specify the columns to join.

In [45]:
#trans_prod = transaction_data.merge(product_data,how ='inner', left_on='PRODUCT NUM', right_on='PRODUCT CODE')

In [50]:
from sklearn.cluster import KMeans
from sklearn.cluster import AgglomerativeClustering

In [51]:
cluster_input =customer_data[["INCOME","AGE"]]
cluster_input.head(5)

   INCOME  AGE
0  133498   64
1   94475   42
2   88610   40
3   84313   38
4   51498   30

Initialize a K-means model with four clusters

In [54]:
kmeans_model = KMeans (n_clusters =4)

In [56]:
kmeans_model.fit (cluster_input)

KMeans(n_clusters=4)

In [58]:
cluster_output = kmeans_model.fit_predict(cluster_input)
cluster_output

#. Indexes are in the range of [0,1,2,3] because you specified four clusters.
#output is in a 1D array

array([1, 0, 0, 0, 2, 1, 0, 3, 3, 0, 2, 3, 0, 0, 2, 0, 0, 3, 1, 0, 3, 3,
       3, 2, 3, 3, 0, 2, 2, 1, 0, 2, 2, 3, 2, 2, 2, 3, 3, 2, 2, 0, 0, 0,
       1, 2, 2, 0, 1, 2, 3, 2, 2, 2, 3, 2, 3, 3, 3, 2, 0, 3, 1, 3, 1, 0,
       0, 3, 2, 0, 0, 2, 0, 0, 1, 2, 0, 2, 0, 1, 0, 3, 1, 3, 2, 3, 1, 2,
       0, 2, 3, 1, 3, 3, 3, 0, 3, 2, 1, 3, 2, 2, 2, 2, 0, 3, 3, 2, 0, 2,
       2, 2, 0, 2, 3, 2, 1, 1, 0, 0, 2, 3, 3, 2, 0, 0, 3, 0, 2, 1, 0, 0,
       2, 0, 1, 3, 1, 1, 3, 0, 0, 2, 2, 2, 0, 3, 3, 2, 3, 0, 0, 3, 3, 3,
       0, 3, 2, 2, 3, 2, 1, 2, 1, 3, 2, 0, 2, 1, 0, 2, 1, 2, 3, 3, 1, 2,
       1, 1, 3, 2, 1, 2, 0, 2, 3, 1, 3, 3, 2, 1, 2, 3, 3, 1, 3, 1, 3, 1,
       3, 0, 3, 2, 1, 1, 3, 2, 0, 1, 1, 1, 1, 2, 3, 0, 1, 3, 2, 3, 0, 2,
       0, 2, 3, 2, 2, 2, 3, 2, 2, 0, 3, 0, 3, 0, 0, 2, 3, 1, 2, 2, 2, 0,
       0, 0, 0, 2, 3, 3, 1, 2, 0, 3, 2, 3, 2, 0, 2, 1, 3, 3, 2, 1, 2, 0,
       0, 1, 3, 0, 0, 3, 1, 2, 1, 2, 2, 2, 1, 0, 3, 3, 3, 0, 0, 0, 1, 0,
       3, 0, 3, 1, 1, 2, 2, 1, 2, 2, 2, 2, 0, 0, 2, 0, 0, 1, 2, 1, 2, 2,
       1, 2, 2, 3, 0, 0, 0, 0, 2, 1, 3, 2, 3, 0, 2, 0, 2, 0, 0, 2, 3, 2,
       2, 3, 2, 0, 0, 2, 2, 3, 3, 3, 3, 1, 3, 0, 3, 3, 0, 1, 3, 0, 2, 0,
       2, 3, 1, 1, 3, 0, 0, 0, 1, 0, 2, 3, 0, 2, 0, 3, 3, 0, 3, 0, 0, 1,
       0, 1, 3, 0, 0, 3, 0, 2, 2, 2, 1, 0, 2, 0, 1, 2, 1, 2, 0, 1, 2, 3,
       1, 0, 1, 0, 3, 1, 2, 0, 1, 0, 2, 1, 0, 0, 1, 3, 2, 0, 1, 2, 3, 3,
       1, 2, 2, 0, 0, 0, 3, 0, 1, 3, 0, 2, 3, 0, 0, 2, 1, 0, 3, 3, 0, 3,
       3, 2, 0, 1, 2, 0, 1, 2, 2, 0, 2, 2, 2, 2, 1, 0, 3, 3, 0, 2, 1, 0,
       3, 0, 1, 3, 0, 2, 2, 3, 1, 0, 1, 3, 3, 0, 0, 0, 2, 2, 2, 3, 3, 1,
       0, 2, 0, 2, 3, 1, 0, 0, 1, 0, 2, 3, 3, 3, 2, 0], dtype=int32)

In [65]:
# convert the 1-dimensional NumPy array to a Pandas data frame 

cluster_output_df = pd.DataFrame(cluster_output,columns=['segment'])
cluster_output_df.head()

   segment
0        1
1        0
2        0
3        0
4        2

In [69]:
#Merge the cluster output,input and segment
segment_DF=pd.concat([cluster_input,cluster_output_df],axis=1)

segment_DF.head()

   INCOME  AGE  segment
0  133498   64        1
1   94475   42        0
2   88610   40        0
3   84313   38        0
4   51498   30        2